//Значення хуку useAuth() будемо передавати через контекст цього файлу
import {createContext} from 'react'

//функція яка передаватиметься по замовчуванні і яка нічого не робить
function noop() {}

//Контекст створюється через звичайну функцію в реакт 
//createContext() - куди передаю базові складові для цього контексту
//Це контекст що зможе передавати параметри 
//не по деревовидній структурі а з використанням контексту по всьому нашому додатку
export const AuthContext = createContext({
  token: null,
  userId: null,
  login: noop,
  logout: noop,
//Цей флаг вказуватиме - зареєстрований користувач в стстемі чи ні.
  isAuthenticated: false
})
